add graphs to docs-site/
